// Generated by jextract

package org.ffmpeg.bindings;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct AVHDRPlusColorTransformParams {
 *     AVRational window_upper_left_corner_x;
 *     AVRational window_upper_left_corner_y;
 *     AVRational window_lower_right_corner_x;
 *     AVRational window_lower_right_corner_y;
 *     uint16_t center_of_ellipse_x;
 *     uint16_t center_of_ellipse_y;
 *     uint8_t rotation_angle;
 *     uint16_t semimajor_axis_internal_ellipse;
 *     uint16_t semimajor_axis_external_ellipse;
 *     uint16_t semiminor_axis_external_ellipse;
 *     enum AVHDRPlusOverlapProcessOption overlap_process_option;
 *     AVRational maxscl[3];
 *     AVRational average_maxrgb;
 *     uint8_t num_distribution_maxrgb_percentiles;
 *     AVHDRPlusPercentile distribution_maxrgb[15];
 *     AVRational fraction_bright_pixels;
 *     uint8_t tone_mapping_flag;
 *     AVRational knee_point_x;
 *     AVRational knee_point_y;
 *     uint8_t num_bezier_curve_anchors;
 *     AVRational bezier_curve_anchors[15];
 *     uint8_t color_saturation_mapping_flag;
 *     AVRational color_saturation_weight;
 * }
 * }
 */
public class AVHDRPlusColorTransformParams {

    AVHDRPlusColorTransformParams() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        AVRational.layout().withName("window_upper_left_corner_x"),
        AVRational.layout().withName("window_upper_left_corner_y"),
        AVRational.layout().withName("window_lower_right_corner_x"),
        AVRational.layout().withName("window_lower_right_corner_y"),
        FFMPEG.C_SHORT.withName("center_of_ellipse_x"),
        FFMPEG.C_SHORT.withName("center_of_ellipse_y"),
        FFMPEG.C_CHAR.withName("rotation_angle"),
        MemoryLayout.paddingLayout(1),
        FFMPEG.C_SHORT.withName("semimajor_axis_internal_ellipse"),
        FFMPEG.C_SHORT.withName("semimajor_axis_external_ellipse"),
        FFMPEG.C_SHORT.withName("semiminor_axis_external_ellipse"),
        FFMPEG.C_INT.withName("overlap_process_option"),
        MemoryLayout.sequenceLayout(3, AVRational.layout()).withName("maxscl"),
        AVRational.layout().withName("average_maxrgb"),
        FFMPEG.C_CHAR.withName("num_distribution_maxrgb_percentiles"),
        MemoryLayout.paddingLayout(3),
        MemoryLayout.sequenceLayout(15, AVHDRPlusPercentile.layout()).withName("distribution_maxrgb"),
        AVRational.layout().withName("fraction_bright_pixels"),
        FFMPEG.C_CHAR.withName("tone_mapping_flag"),
        MemoryLayout.paddingLayout(3),
        AVRational.layout().withName("knee_point_x"),
        AVRational.layout().withName("knee_point_y"),
        FFMPEG.C_CHAR.withName("num_bezier_curve_anchors"),
        MemoryLayout.paddingLayout(3),
        MemoryLayout.sequenceLayout(15, AVRational.layout()).withName("bezier_curve_anchors"),
        FFMPEG.C_CHAR.withName("color_saturation_mapping_flag"),
        MemoryLayout.paddingLayout(3),
        AVRational.layout().withName("color_saturation_weight")
    ).withName("AVHDRPlusColorTransformParams");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout window_upper_left_corner_x$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("window_upper_left_corner_x"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * AVRational window_upper_left_corner_x
     * }
     */
    public static final GroupLayout window_upper_left_corner_x$layout() {
        return window_upper_left_corner_x$LAYOUT;
    }

    private static final long window_upper_left_corner_x$OFFSET = $LAYOUT.byteOffset(groupElement("window_upper_left_corner_x"));

    /**
     * Offset for field:
     * {@snippet lang=c :
     * AVRational window_upper_left_corner_x
     * }
     */
    public static final long window_upper_left_corner_x$offset() {
